app/controllers/admin/console_controller.rb

SELECT "slider_images".* FROM "slider_images"
---
  def index
    @posts = Post.all.sorted.includes(:tags).as_json(include: [:tags])
    @messages = Message.all.sorted
    @slider_images = SliderImage.all