app/controllers/admin/console_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."post_id" = ? LIMIT ?  [["post_id", 32], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (2, 20, 3, 19, 23, 5, 4, 16)
SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def index
    @posts = Post.all.sorted.includes(:tags).as_json(include: [:tags, :image])
    @messages = Message.all.sorted

INSERT INTO "images" ("image", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)  [["image", "cat3.jpg"], ["created_at", "2017-09-22 16:57:59.396750"], ["updated_at", "2017-09-22 16:57:59.396750"], ["post_id", 32]]
INSERT INTO "posts" ("title", "text", "permalink", "created_at", "updated_at", "logo") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fsd"], ["text", "dfgdfg"], ["permalink", "dfgdfgdf"], ["created_at", "2017-09-29 17:58:26.023775"], ["updated_at", "2017-09-29 17:58:26.023775"], ["logo", "cat1.jpeg"]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "oppopo"]]
---
  def create_post
    @image = Image.new
    @image.image = image_params[:image]

    @post = Post.new(post_params)
    @post.permalink.downcase!
    @post.image = @image

    begin
      @post.tags = parsed_tags
    rescue Exception => e
      logger.warn(e.message)
      render json: {"error": e.message}, status: 500
      return
    end

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT  "images".* FROM "images" WHERE "images"."post_id" = ? LIMIT ?  [["post_id", 15], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 30]]
UPDATE "images" SET "post_id" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["post_id", 15], ["updated_at", "2017-09-22 14:27:53.513582"], ["id", 33]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Atrribute"], ["updated_at", "2017-09-22 19:22:30.512303"], ["id", 32]]
---
  def update_post
    @post = Post.find(params[:id])
    @post.tags = []
    @post.permalink.downcase!

    begin
      @post.tags = parsed_tags
    rescue Exception => e
      logger.warn(e.message)
      render json: {"error": e.message}, status: 500
      return
    end
    if post_params[:image_id].present?
      @post.image = Image.find(post_params[:image_id])
    end
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 30]]
---
  def destroy_post
    @post = Post.find(params[:id])
    @post.destroy

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def delete_message
    @message = Message.find(params[:id])
    if @message.delete

SELECT "tags".* FROM "tags" WHERE "tags"."name" = ?  [["name", "oppopo"]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "[object Object]"]]
---
  def find_or_add_tag(tag_name)
    existing_tag = Tag.where(:name => tag_name)

    if existing_tag.blank?
      t = Tag.new(:name => tag_name)
      if t.save then