app/controllers/admin/images_controller.rb

  def create
    @image = Image.new
    @image.image = image_params[:data]
    if @image.save
---
INSERT INTO "images" ("image", "created_at", "updated_at") VALUES (?, ?, ?)  [["image", "img1.jpg"], ["created_at", "2017-06-23 03:01:18.804262"], ["updated_at", "2017-06-23 03:01:18.804262"]]

  def destroy
    @image = Image.find(params[:id])
    unused = Post.all.where(:image_id => @image.id).empty?
    if unused
      @image.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "posts" WHERE "posts"."image_id" = ? LIMIT ?  [["image_id", 15], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 15]]