app/controllers/admin/posts_controller.rb

  def index
    @posts = Post.all.sorted.includes(:tags).as_json(include: :tags)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 3]]

  def create
    @post = Post.new(post_params)
    @post.tags = []

    begin
      @post.tags << parsed_tags
---
INSERT INTO "posts" ("title", "text", "permalink", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "NewPost2"], ["text", "lalalal2"], ["permalink", "post2"], ["created_at", "2017-07-03 04:09:16.400955"], ["updated_at", "2017-07-03 04:09:16.400955"]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "tag21"]]

  def update
    @post = Post.find(params[:id])
    @post.tags = []

    begin
      @post.tags << parsed_tags
    rescue Exception => e
      logger.warn(e.message)
      render json: {"error": e.message}, status: 500
      return
    end

    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "tag"]]
UPDATE "posts" SET "title" = ?, "permalink" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Updated Post"], ["permalink", "updated-post"], ["updated_at", "2017-06-20 09:15:31.524638"], ["id", 3]]

  def find_or_add_tag(tag_name)
    existing_tag = Tag.where(:name => tag_name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ?  [["name", "tag2"]]