app/controllers/admin/slider_images_controller.rb

  def create
    @slider_image = SliderImage.new
    @slider_image.image = image_params[:image]
    if @slider_image.save
---
INSERT INTO "slider_images" ("image", "created_at", "updated_at") VALUES (?, ?, ?)  [["image", "cat1.jpeg"], ["created_at", "2017-10-18 18:32:43.690358"], ["updated_at", "2017-10-18 18:32:43.690358"]]

  def destroy
    @slider_image = SliderImage.find(params[:id])
    if @slider_image.destroy
---
SELECT  "slider_images".* FROM "slider_images" WHERE "slider_images"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "slider_images" WHERE "slider_images"."id" = ?  [["id", 1]]