app/controllers/public_controller.rb

  def authorize
    if user_params[:login].present? and user_params[:password].present?
      login = user_params[:login]
      pass = user_params[:password]
      @user = AdminUser.where(login: login).first
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."login" = ? ORDER BY "admin_users"."id" ASC LIMIT ?  [["login", "ian"], ["LIMIT", 1]]

  def home
      @posts = Post.sorted.limit(4)
      puts "POSTS SIZE: #{@posts.size}"
---
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 4]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" ORDER BY created_at DESC LIMIT ?) subquery_for_count  [["LIMIT", 4]]