app/views/public/_posts.html.haml

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 4]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 4]]
---
        .post__title= post.title
        - if post.logo
          .post__logo= image_tag( post.logo.url )
        .post__text=  post.text.truncate_words 15
        .post__views= post.views.to_s + ' Views'
        .post__likes= post.likes.size.to_s + ' Likes'
        .post__tags
          - post.tags.each do |tag|
            .post__tag= '#' + tag.name